Repository: OmegaT-L10N/ar
Catalog: tm/3.1_aligned.tmx
Source language: en
Languages: ar

source: Will be synchronized next time.
ar: سوف تتم المزامنة في المرة المقبلة.

source: Upload disabled because repository in read-only mode
ar: تحميل علوي معاق ﻷن المستودع يتواجد في نمط القراءة فقط

source: Unsupported SVN error
ar: خطأ SVN غير مدعم

source: During SVN error({0}), project_save.tmx was not really uploaded and SVN switched to unstable status.
ar: أثناء حصول خطأ SVN ({0})، تعذر التحميل العلوي لذاكرة project_save.tmx وانتقل SVN إلى الوضع غير المستقر.

source: To be sure that no translation will be lost, you need to: 1.
ar: للتأكد من عدم ضياع أي ترجمة، يجب القيام بما يلي: 1.

source: Copy <project>/omegat/project_save.tmx file into a safe location 2.
ar: انسخ ملف project>/omegat/project_save.tmx> في موضع آمن 2.

source: Close the current OmegaT instance 3.
ar: أغلق تجسيد أوميجاتي الحالي 3.

source: Remove the project folder manually.
ar: احذف مجلد المشروع بشكل يدوي.

source: WARNING: all unsaved data will be lost 4.
ar: تحذير: سوف تضيع كافة البيانات غير المحفوظة 4.

source: Start OmegaT again, download the team project, close OmegaT 5.
ar: شغل أوميجاتي من جديد، حمل المشروع الجماعي، ثم أغلق أوميجاتي 5.

source: Replace <project>/omegat/project_save.tmx in the newly downloaded project with the file saved in a safe location 6.
ar: عوض <project>/omegat/project_save.tmx في المشروع المحمل من جديد بالملف المخزن في موضع آمن 6.

source: Start OmegaT and continue to translate
ar: شغل أوميجاتي وتابع الترجمة

source: Git '{0}' execution start
ar: بدء تنفيذ Git '{0}'

source: Git '{0}' execution finished successfully
ar: انتهى تنفيذ Git '{0}' بنجاح

source: Git '{0}' error: {1}
ar: خطأ Git '{0}': {1}

source: Push failed.
ar: فشل الدفع.

source: Read-only
ar: نمط القراءة فقط

source: Force saving password as plain text
ar: افرض حفظ كلمة السر بصيغة النص البسيط

source: No connection available, the project is in offline mode.
ar: ليس هناك أي اتصال بالشبكة. المشروع يتواجد في نمط التشغيل دون الاتصال بالشبكة.

source: Connection available, the project is in team project mode.
ar: اتصال متوفر. المشروع يتواجد في نمط المشاريع الجماعية.

source: Authentication
ar: التحقق

source: Please enter username/password
ar: يرجى إدخال اسم المستخدم/كلمة السر

source: Wrong username/password
ar: اسم مستخدم/كلمة سر خاطئ(ة)

source: Wrong authentication
ar: تحقق خاطئ

source: Repository Type:
ar: نوع المستودع:

source: Repository URL:
ar: محدد الموارد الموحد للمستودع:

source: Team Project
ar: مشروع جماعي

source: Local Folder:
ar: مجلد محلي:

source: Checking out the project...
ar: جار تحميل نسخة عملية من المشروع...

source: Error checking out the project from remote repository:
ar: حدث خطأ أثناء تحميل نسخة من المشروع من المستودع الطرفي:

source: Error checking out the project from remote repository: {0}
ar: حدث خطأ أثناء تحميل نسخة من المشروع من المستودع الطرفي: {0}

source: Local translation not synchronized with remote repository.
ar: لم تتم مزامنة الترجمة المحلية مع المستودع الطرفي.

source: Project will not be updated.
ar: لن يتم تحديث المشروع.

source: Team synchronization
ar: مزامنة جماعية

source: Team synchronization...
ar: مزامنة جماعية...

source: Team synchronization: Waiting for you to finish this segment...
ar: مزامنة جماعية: بانتظار إنهائك للمقطع...

source: Team synchronization: Saving translation in {0} s
ar: مزامنة جماعية: حفظ الترجمة في {0} ثوان

source: Synchronization error
ar: خطأ مزامنة

source: Cancelled creating new team project
ar: إلغاء إنشاء مشروع جماعي جديد

source: User denied credentials
ar: بيانات هوية المستخدم مرفوضة

source: The project folder {0} is missing and could not be created.
ar: مجلد المشاريع {0} غير متوفر ولم يتسن إنشاؤه.

source: Could not save credentials to text file
ar: تعذر حفظ بيانات الهوية في ملف النص

source: Detecting...
ar: جار الكشف...

source: An error occurred when trying to detect the repo type.
ar: حدث خطأ أثناء محاولة الكشف عن نوع المستودع.

source: This is a Git repository.
ar: هذا مستودع Git.

source: This is a Subversion repository.
ar: هذا مستودع Subversion.

source: This URL appears to be invalid.
ar: يبدو أن محدد الموارد الموحد غير صالح.

source: Please double-check it.
ar: يرجى التحقق من صلاحيته.

source: Start rebase
ar: بدء إعادة تطبيق التعديلات الفرعية

source: End rebase
ar: إنهاء إعادة تطبيق التعديلات الفرعية

source: Saving and Output Options
ar: خيارات الحفظ والخرج

source: Please select the interval at which the project should be saved automatically, in minutes and seconds.
ar: يرجى اختيار المجال الزمني المخصص لحفظ المشروع بشكل تلقائي، بالدقائق والثواني.

source: Minutes:
ar: الدقائق:

source: Seconds:
ar: الثواني:

source: External Post-processing Command
ar: اﻷمر الخارجي للمعالجة اللاحقة

source: This command will be executed after Creating Translated Documents.
ar: سوف ينفذ هذا اﻷمر بعد إنشاء المستندات المترجمة.

source: Also allow per-project external commands
ar: السماح أيضاً باستخدام اﻷوامر الخارجية المخصصة لكل مشروع على حدة

source: Non-breakable space
ar: فراغ غير قابل للكسر

source: Tab
ar: زر الجدولة

source: Tag
ar: علامة

source: Text to be removed
ar: النص الذي يجب حذفه

source: Duplicate
ar: إنشاء نسخة مطابقة

source: Bad nesting
ar: تداخل غير صالح

source: Missing
ar: ناقص

source: Extraneous
ar: دخيل

source: Out-of-order
ar: معطل

source: Whitespace
ar: مسافة بيضاء

source: Orphaned
ar: مهمل

source: Unspecified
ar: غير محدد

source: Fix
ar: تصحيح

source: Fix all
ar: تصحيح الكل

source: Are you sure you want to fix all tags automatically? This operation will affect {0} segments and cannot be undone.
ar: هل أنت متأكد من رغبتك في إصلاح كافة العلامات بشكل تلقائي؟ سوف تؤثر هذه العملية على {0} مقطع ولن يمكنك التراجع عنها فيما بعد.

source: Error fixing tags
ar: حدث خطأ أثناء تصحيح العلامات

source: The translation has changed.
ar: لقد تغيرت الترجمة.

source: Please redo tag validation.
ar: يرجى التحقق من صحة العلامات من جديد.

source: <No suggestions>
ar: <ليست هناك أي اقتراحات>

source: Press <u>{0}</u> to return to <b>{1}</b> suggestions.
ar: انقر على <u>{0}</u> للعودة إلى <b>{1}</b> اقتراحات.

source: Press <u>{0}</u> to go to <b>{1}</b> suggestions.
ar: انقر على <u>{0}</u> للانتقال إلى <b>{1}</b> اقتراحات.

source: Glossary entries
ar: مداخل مسرد المصطلحات

source: Missing tags
ar: العلامات الناقصة

source: Autotext entries
ar: مداخل النص التلقائي

source: Character table
ar: جدول اﻷحرف

source: Display source terms
ar: عرض مصطلحات المصدر

source: When checked, the items in the glossary auto-completer view will contain the source text, too.
ar: إذا تم تفعيل الخيار، فإن العناصر المتواجدة في عرض المكمل التلقائي لمسرد المصطلحات ستتضمن النص اﻷصلي بدوره.

source: Show longer target terms first
ar: عرض مصطلحات الهدف اﻷطول أولاً

source: If checked, the longer entries are placed on the list first.
ar: إذا تم تفعيل الخيار، فإن المداخل الأطول ستوضع في القائمة أولاً.

source: Sort by source term alphabetically
ar: ترتيب هجائي عبر مصطلحات المصدر

source: Sort target terms alphabetically
ar: ترتيب هجائي عبر مصطلحات الهدف

source: If checked, the entries are sorted alphabetically.
ar: إذا تم تفعيل الخيار، فإن المداخل سترتب وفق ترتيبها الهجائي.

source: Auto-completer Glossary View configuration
ar: خيارات المكمل التلقائي لمسرد المصطلحات

source: Show target term first
ar: عرض مصطلح الهدف أولاً

source: Displays the entries as "<target> → <source>"
ar: عرض المداخل وفق الشكل اﻵتي "<هدف> → <مصدر>"

source: Show source term first
ar: عرض مصطلح المصدر أولاً

source: Terms with multiple targets
ar: المصطلحات المتوفرة على أهداف متعددة

source: Follow capitalization of the typed text
ar: اعتماد نمط استخدام الحروف المطبق بالنص المحرر

source: Sort by length
ar: ترتيب حسب الطول

source: Sort alphabetically
ar: ترتيب هجائي

source: Sort by full text, not shortcut
ar: ترتيب عبر النص الكامل، دون اختصارات

source: Auto-text configuration
ar: تكوين النص التلقائي

source: Display
ar: عرض

source: Entries
ar: مداخل

source: &Load...
ar: &تحميل...

source: &Save...
ar: &حفظ...

source: Auto-text file (*.autotext)
ar: ملف النص التلقائي (*.autotext)

source: Unable to save data.
ar: تعذر حفظ البيانات.

source: Shortcut
ar: اختصار

source: Full text
ar: نص كامل

source: Comment
ar: تعليق

source: Character table auto-completer options
ar: خيارات المكمل التلقائي لجدول اﻷحرف

source: Customize character table
ar: تشخيص جدول اﻷحرف

source: Add characters to the custom table by double-clicking, or by highlighting and pressing the Insert key.
ar: إضافة أحرف لجدول التخصيص من خلال النقر مرتين، أو عبر إبراز النص والنقر على مفتاح الحشر.

source: Full table
ar: جدول كامل

source: Custom table
ar: جدول مخصص

source: Allow only unique characters
ar: السماح باﻷحرف المنفردة فقط

source: Clear
ar: مسح

source: Warning!
ar: تحذير!

source: You are trying to use the HunspellTokenizer with the language {0}, but no spelling dictionaries are installed for this language.
ar: إنك تحاول استخدام وحدة Hunspell لتشخيص كلمات اللغة {0}. لكن، ليس هناك أي قاموس إملائي مثبت لهذه اللغة.

source: For best results, please install the appropriate dictionaries via Options > Spell Checking.
ar: للحصول على أفضل النتائج، يرجى تثبيت القواميس الملائمة عبر 'خيارات' > 'تدقيق إملائي'.

source: Server (original)
ar: خادم (أصلي)

source: Mine
ar: خاص بي

source: Server (updated)
ar: خادم (محدث)

source: Merge
ar: دمج

source: Please resolve the conflicts by choosing a translation for each segment below.
ar: يرجى حل التعارضات عبر اختيار ترجمة لكل مقطع من المقاطع المعروضة أدناه.

source: {0} segments
ar: {0} مقاطع

source: 1 segment
ar: مقطع 1

source: {0} conflicts
ar: {0} تعارضات

source: 1 conflict
ar: تعارض 1

source: Details unavailable
ar: تفاصيل غير متوفرة

source: Use all mine
ar: استخدام كل ما يخصني

source: Use all original
ar: استخدام اﻷصلي بأكمله

source: Use all updated
ar: استخدام المحدث بأكمله

source: Done
ar: تم

source: Conflict resolution
ar: حل التعارضات

source: Processing...
ar: معالجة جارية...

source: Conflict {0} of {1}
ar: تعارض {0} من {1}

source: Deleted
ar: محذوف

source: Not present
ar: غير متوفر

source: List View
ar: عرض القائمة

source: Detail View
ar: عرض التفاصيل

source: ← Back
ar: ← الرجوع

source: Next →
ar: التقدم →

source: Change date
ar: تعديل التاريخ

source: Changer
ar: المسؤول عن التعديل

source: Creation date
ar: تاريخ الإنشاء

source: Creator
ar: المُنشأ

source: Is default translation
ar: هي الترجمة الافتراضية

source: Note
ar: ملاحظة

source: Source
ar: مصدر

source: Translation
ar: ترجمة

source: File
ar: ملف

source: Next
ar: الموالي

source: Previous
ar: السابق

source: Added: {1}, Deleted: {2}, Modified: {3} (Conflicts: {0})
ar: مضاف: {1}, محذوف: {2}, معدل: {3} (تعارضات: {0})

source: Request to TaaS: {0}
ar: الطلبات الموجهة إلى TaaS: {0}

source: &Browse TaaS Collections...
ar: &تصفح مجموعات TaaS...

source: &Select TaaS Terminology Lookup Domain...
ar: &اختيار نطاق البحث عن المصطلحات TaaS...

source: &TaaS Terminology Lookup
ar: &البحث عن المصطلحات في إطار TaaS

source: TaaS Collections
ar: مجموعات TaaS

source: Name
ar: الاسم

source: Description
ar: الوصف

source: Source count
ar: تعداد المصدر

source: Target count
ar: تعداد الهدف

source: Domains
ar: النطاقات

source: Updated
ar: المحدث

source: &Download
ar: &تحميل

source: All domains
ar: كافة النطاقات

source: &Select
ar: &اختيار

source: Retrieve collection list...
ar: استرجاع قائمة المجموعات...

source: Select TaaS domain
ar: اختيار نطاق TaaS

source: Retrieve domain list...
ar: استرجاع قائمة النطاقات...

source: Download collection {0}
ar: تحميل المجموعة {0}

source: Request error: {0}
ar: خطأ بالطلب: {0}

source: Unauthorized request to TaaS service
ar: طلب غير مرخص لخدمة TaaS

source: Wrong response format from TaaS service
ar: صيغة رد خاطئة من خدمة TaaS

source: Error updating glossary file
ar: حدث خطأ أثناء تحديث ملف المسرد

source: TaaS API key not found.
ar: تعذر العثور على مفتاح واجهة TaaS.

source: Go to https://demo.taas-project.eu/account/keys/create?system=omegaT to create your own key then give it to OmegaT with -Dtaas.user.key=xxxxx
ar: اذهب إلى https://demo.taas-project.eu/account/keys/create?system=omegaT لإنشاء مفتاحك الخاص، ثم أعطه ﻷوميجاتي بواسطة with -Dtaas.user.key=xxxxx

source: Exclusion patterns
ar: أنماط الإقصاء

source: Mask
ar: حجب

source: <html>You can add patterns using wildcards (ant style): '*', '?' and '**', like '**/.svn/**'</html>
ar: <html>يمكنك إضافة أنماط جديدة بواسطة رموز التعميم (نوع ant): '*'، '?' و'**'، مثلاً '**/.svn/**'</html>

source: Custom Colours Selection
ar: اختيار ألوان مخصصة

source: OmegaT Custom Colours
ar: ألوان أوميجاتي المخصصة

source: Background
ar: الخلفية

source: Active segment source
ar: مصدر المقطع النشط

source: Active segment source text
ar: نص مصدر المقطع النشط

source: Active segment target
ar: هدف المقطع النشط

source: Active segment target text
ar: نص هدف المقطع النشط

source: Source segments
ar: مقاطع المصدر

source: Source segments text
ar: نص مقاطع المصدر

source: Segments with notes
ar: المقاطع المرفقة بملاحظات

source: Segments with notes text
ar: المقاطع المرفقة بنصوص الملاحظات

source: Untranslated segments
ar: المقاطع غير المترجمة

source: Untranslated segments text
ar: نص المقاطع غير المترجمة

source: Translated segments
ar: المقاطع المترجمة

source: Translated segments text
ar: نص المقاطع المترجمة

source: Non-unique segments
ar: المقاطع غير الانفرادية

source: Non-unique segments background
ar: خلفية المقاطع غير الانفرادية

source: Modification info
ar: معلومات التعديل

source: Modification info text
ar: نص معلومات التعديل

source: Tags
ar: علامات

source: Remove text target
ar: حذف هدف النص

source: Non-breakable spaces
ar: فراغات غير قابلة للكسر

source: Whitespaces
ar: مسافات بيضاء

source: Bidirectional control characters
ar: أحرف التحكم للاتجاه الثنائي

source: From memory
ar: من الذاكرة

source: From ICE memory
ar: من ذاكرة ICE

source: From 100% memory
ar: من ذاكرة 100%

source: From auto memory
ar: من الذاكرة اﻷوتوماتيكية

source: Replace
ar: استبدال

source: TransTips
ar: التلميحات الخاصة بالترجمة

source: Spellcheck
ar: المصحح اللغوي

source: Matches Changed
ar: لقد تغيرت التطابقات

source: Matches Unchanged
ar: لم تتغير التطابقات

source: Matches Inserted Active
ar: إدخال التطابقات مفعل

source: Matches Inserted Inactive
ar: إدخال التطابقات غير مفعل

source: Matches Deleted Active
ar: حذف التطابقات مفعل

source: Matches Deleted Inactive
ar: حذف التطابقات غير مفعل

source: Item:
ar: العنصر:

source: &Reset This Colour
ar: &إعادة ضبط هذا اللون

source: Reset &All Colours
ar: إعادة &ضبط كافة اﻷلوان

source: The new colours have been saved.
ar: تم حفظ اﻷلوان الجديدة.

source: Please restart the application to correctly display the new colours.
ar: يرجى إعادة تشغيل التطبيق لعرض اﻷلوان الجديدة بشكل صحيح.

source: <html><i>Options</i> &gt; <i>Use TAB to Advance</i> is checked</html>
ar: <html><i>خيارات</i> &gt; <i>استخدام زر الجدولة للتقدم</i> is مفعل</html>
